Enums/ВариантыВажностиЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВариантыВажностиЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыВажностиВзаимодействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВариантыВажностиВзаимодействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыИсходящегоЭлектронногоПисьма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыИсходящегоЭлектронногоПисьма</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Заявка</Name>
			<BasedOn>
				<xr:Item>Document.Встреча</xr:Item>
				<xr:Item>Document.ТелефонныйЗвонок</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоВходящее</xr:Item>
				<xr:Item>Document.ЭлектронноеПисьмоИсходящее</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРаздела</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРазделов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассмотретьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокУчастников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаСостоянияБД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторБД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОтвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОтправке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/УчетныеЗаписиЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиЭлектроннойПочты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Comment>Имя отправителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверВходящейПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверИсходящейПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервераВходящейПочты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервераИсходящейПочты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОставлятьКопииСообщенийНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодХраненияСообщенийНаСервере</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляПолучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколВходящейПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединениеДляВходящейПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезопасныйВходНаСерверВходящейПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезопасныйВходНаСерверИсходящейПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяВходНаСерверПередОтправкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВПредставлениеВключатьИмяПользователя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтветственныйЗаОбработкуПисем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособPOP3Аутентификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыPOP3Аутентификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособSMTPАутентификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыSMTPАутентификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPАутентификация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыSMTPАутентификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ТехПоддержка/Ext/Form/Module.bsl
&НаКлиенте
Процедура Декорация7Нажатие(Элемент)
	
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ОтправитьЗаявку;
	Элементы.ЗаявкаОтправитьЗаявку.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация6Нажатие(Элемент)
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ОтправкаЭлектронногоПисьма;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗаявку(Команда)
	Если СокрЛП(Заявка.ПолучитьТекст()) = ""  Тогда
		Текст = НСтр("ru='Заявка без содержания либо картинка без сопровождения текста. Заявка обязательно должна сопровожтаться пояснительным текстом';uk=""Заявка без вмісту або картинка без супроводу тексту. Заявка обов'язково повинна сопровожтаться пояснювальним текстом""");
		Ответ = Вопрос(Текст,РежимДиалогаВопрос.ОК);
	Иначе
		Состояние(НСТР("ru = 'Выполняется отправка заявки в службу поддержки'; uk = 'Виконується відправка заявки в службу підтримки'"));
		СоздатьЗаявку();
		Элементы.ЗаявкаОтправитьЗаявку.Доступность = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура  СоздатьЗаявку()
	
	
	НовыйДокумент = Документы.Заявка.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДата();
	НовыйДокумент.Описание = Новый ХранилищеЗначения(Заявка);
	НовыйДокумент.Тема = "Заявка от "+Строка(Константы.ЗаголовокСистемы.Получить());
	НовыйДокумент.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая;
	НовыйДокумент.СтрокаСостоянияБД = ПолучитьСтрокуСостоянияБД();
	НовыйДокумент.ИдентификаторБД = ПолучитьИдентификаторБД();
	НовыйДокумент.Автор = Пользователи.АвторизованныйПользователь();
	НовыйДокумент.Рассмотрено = Ложь;
	НовыйДокумент.Записать();
	Попытка
		//ОбменДаннымиТехПоддержка.ОбработкаКомандыСервер();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Заявка отправлена';uk='Заявку відправлено'",);
		Сообщение.Поле = "";
		Сообщение.Сообщить();
	Исключение
		НовыйДокумент.Удалить();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не удалось установить подключение. Заявка не была отпрвлена';uk='Не вдалося встановити підключення. Заявка не була отпрвлена'");
		Сообщение.Сообщить(); 
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация9Нажатие(Элемент)
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ОтправкаЭлектронногоПисьма;
КонецПроцедуры

&НаКлиенте
Процедура Декорация10Нажатие(Элемент)
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ОтправитьЗаявку;
	Элементы.ЗаявкаОтправитьЗаявку.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Декорация11Нажатие(Элемент)
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.КонтактыРазработчиков;

КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.НачальнаяСтраница;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	
	  Состояние(НСТР("ru = 'Выполняется отправка заявки в службу поддержки'; uk = 'Виконується відправка заявки в службу підтримки'"));
	  ОтправитьПисьмоСервер();
	  
	  ТекстВопроса = НСтр("ru = 'Отправка писем завершена'; uk = 'Відправка листів завершена'");
	  Ответ = Вопрос(ТекстВопроса,РежимДиалогаВопрос.ОК);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмоСервер()
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоРеквизиту("ИмяПользователя",Пользователи.АвторизованныйПользователь());
	
	Если УчетнаяЗапись.АдресЭлектроннойПочты = "" Тогда
		УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	КонецЕсли;
	
	Если  УчетнаяЗапись.АдресЭлектроннойПочты <> "" Тогда
				
		ИсходящееПисьмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
		
		ИсходящееПисьмо.Дата = ТекущаяДата();
		ИсходящееПисьмо.УчетнаяЗапись = УчетнаяЗапись;
		
		Если УчетнаяЗапись.Пустая() Тогда
			УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты.Ссылка;
		КонецЕсли;
		ИсходящееПисьмо.УчетнаяЗапись = УчетнаяЗапись;
		ИсходящееПисьмо.ОтправительПредставление = ПолучитьПредставлениеУчетонойЗаписи(УчетнаяЗапись);
		
		НоваяСтрока = ИсходящееПисьмо.ПолучателиПисьма.Добавить();
		НоваяСтрока.Адрес = "gkh@hvoya.com.ua";
				
		ИсходящееПисьмо.Тема = "Заявка от "+Строка(Константы.ЗаголовокСистемы.Получить());
		ИсходящееПисьмо.Важность = Перечисления.ВариантыВажностиВзаимодействия.Высокая;
		ИсходящееПисьмо.Автор = Справочники.Пользователи.НайтиПоНаименованию(Пользователи.АвторизованныйПользователь());
		ИсходящееПисьмо.СписокПолучателейПисьма = "gkh@hvoya.com.ua";
		ИсходящееПисьмо.Кодировка = "UTF-8";
		ИсходящееПисьмо.СтатусПисьма = Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее;
		ИсходящееПисьмо.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
		ИсходящееПисьмо.Ответственный  = Справочники.Пользователи.НайтиПоНаименованию(Пользователи.АвторизованныйПользователь());
		ИсходящееПисьмо.Рассмотрено = Истина;
		ИсходящееПисьмо.Записать();
		СтруктураВложений = Новый Структура;
		Письмо.ПолучитьHTML(ИсходящееПисьмо.ТекстHTML, СтруктураВложений);
		ИсходящееПисьмо.ТекстHTML = Взаимодействия.ОбработатьТекстHTMLДляФорматированногоДокумента(ИсходящееПисьмо.Ссылка,ИсходящееПисьмо.ТекстHTML,СтруктураВложений);
		Письмо.УстановитьHTML(ИсходящееПисьмо.ТекстHTML,СтруктураВложений);
		
		Письмо.ПолучитьHTML(ИсходящееПисьмо.ТекстHTML, СтруктураВложений);
		
		Для каждого Вложение Из СтруктураВложений Цикл
			
			НоваяСтрока = ТаблицаСоответствийИменВложенийИдентификаторам.Добавить();
			НоваяСтрока.ИмяФайла = Вложение.Ключ;
			НоваяСтрока.ИдентификаторФайлаДляHTML = Новый УникальныйИдентификатор;
			НоваяСтрока.Картинка = Вложение.Значение;
			
		КонецЦикла;
		
		ДокументHTMLТекущегоПисьмаПодготовлен = Ложь;
		
		Если ТаблицаСоответствийИменВложенийИдентификаторам.Количество() > 0 Тогда
			
			ДокументHTML = Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ИсходящееПисьмо.ТекстHTML);
			Взаимодействия.ЗаменитьИменаКартинокНаИдентификаторыПочтовыхВложенийВHTML(
			ДокументHTML, ТаблицаСоответствийИменВложенийИдентификаторам.Выгрузить());
			ДокументHTMLТекущегоПисьмаПодготовлен = Истина;
			ИсходящееПисьмо.ЕстьВложения =Истина;
		КонецЕсли;
		
		Если ДокументHTMLТекущегоПисьмаПодготовлен Тогда
			
			ИсходящееПисьмо.ТекстHTML = Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
			ИсходящееПисьмо.Текст     = Взаимодействия.ПолучитьОбычныйТекстИзHTML(ИсходящееПисьмо.ТекстHTML);
			
		КонецЕсли;
		
		
		ТаблицаВложенийКартинокФорматированногоДокумента = Взаимодействия.ПолучитьВложенияПисьмаСНеПустымИД(ИсходящееПисьмо.Ссылка);
		Для каждого Вложение Из ТаблицаВложенийКартинокФорматированногоДокумента Цикл
			УдаленныеВложения.Добавить(Вложение.Ссылка);
		КонецЦикла;
		
		// Удалим удаленные вложения
		Для Каждого УдаленноеВложение Из УдаленныеВложения Цикл
			ОбъектВложение = УдаленноеВложение.Значение.ПолучитьОбъект();
			ОбъектВложение.Удалить();
		КонецЦикла;
		
		УдаленныеВложения.Очистить();
		
		
		Для каждого Вложение Из ТаблицаСоответствийИменВложенийИдентификаторам Цикл
			
			ДвоичныеДанныеКартинки = Вложение.Картинка.ПолучитьДвоичныеДанные();
			АдресКартинкиВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеКартинки, УникальныйИдентификатор);
			ПрисоединенныйФайл = УправлениеЭлектроннойПочтой.ЗаписатьВложениеЭлектронногоПисьмаИзВременногоХранилища(
			ИсходящееПисьмо.Ссылка,
			АдресКартинкиВоВременномХранилище,
			"_" + СтрЗаменить(Вложение.ИдентификаторФайлаДляHTML, "-", "_"),
			ДвоичныеДанныеКартинки.Размер());
			
			Если ПрисоединенныйФайл <> Неопределено Тогда
				ПрисоединенныйФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();
				ПрисоединенныйФайлОбъект.ИДФайлаЭлектронногоПисьма = Вложение.ИдентификаторФайлаДляHTML;
				ПрисоединенныйФайлОбъект.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
	
		Для Каждого СтрокаТаблицыВложений Из Вложения Цикл
			
			Размер = 0;
			ИмяФайла = СтрокаТаблицыВложений.ИмяФайла;
			
			Если СтрокаТаблицыВложений.Расположение = 4 Тогда
				// из временного хранилища
				УправлениеЭлектроннойПочтой.ЗаписатьВложениеЭлектронногоПисьмаИзВременногоХранилища(
				Письмо, СтрокаТаблицыВложений.ИмяФайлаНаКомпьютере, ИмяФайла, Размер);
				
			ИначеЕсли СтрокаТаблицыВложений.Расположение = 3 Тогда
				// из файла на сервере
				
			ИначеЕсли СтрокаТаблицыВложений.Расположение = 1 Тогда
				
				УправлениеЭлектроннойПочтой.ЗаписатьВложениеЭлектронногоПисьмаСкопировавВложениеДругогоПисьма(
				Письмо, СтрокаТаблицыВложений.Ссылка, УникальныйИдентификатор);
				
			ИначеЕсли СтрокаТаблицыВложений.Расположение = 0 Тогда
				// перезаписать вложение
				
			КонецЕсли;
			
			СтрокаТаблицыВложений.Расположение = 0;
			
		КонецЦикла;
		
		ИсходящееПисьмо.Записать(РежимЗаписиДокумента.Запись);
		
		УправлениеЭлектроннойПочтой.ОтправитьПочтуПользователя();
				
	Иначе
		
		ТекстСообщения = НСтр("ru='Не настроена учетная запись электронной почты';uk='Не налаштований обліковий запис електронної пошти'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		   
	КонецЕсли;
	
	
	
КонецПроцедуры // ОтправитьПисьмоСервер()
	 
&НаСервере
Функция ПолучитьПредставлениеУчетонойЗаписи(УчетнаяЗапись)
	 
	 Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат "";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя,
	|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка = &УчетнаяЗапись";
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Представление = Выборка.ИмяПользователя;
	Если ПустаяСтрока(Представление) Тогда
		Возврат Выборка.АдресЭлектроннойПочты;
	Иначе
		Возврат Представление + " <" + Выборка.АдресЭлектроннойПочты + ">";
	КонецЕсли;	
	 
КонецФункции // ()

&НаКлиенте
Процедура Регистрация(Команда)
	Состояние(НСтр("ru = 'Выполняется регистрация, пожалуйста подождите.'; uk = 'Виконується реєстрація, будь ласка почекайте.'"),);
	РегистрацияСервер();
	
	ЦентральныйУзел = ПолучитьЦУ();
	
	Если НЕ ЦентральныйУзел.Пустая() Тогда
		Элементы.Отправка.Видимость = Истина;
		Элементы.Регистрация.Видимость = Ложь;
		ОбновитьОтображениеДанных();
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура РегистрацияСервер()

	НовыйДокумент = Документы.Заявка.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДата();
	НовыйДокумент.Записать();
	Попытка
		ОбменДаннымиТехПоддержка.ОбработкаКомандыСервер();
		НовыйДокумент.Удалить();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Регистрация прошла успешно';uk='Реєстрація пройшла успішно'",);
		Сообщение.Поле = "";
		Сообщение.Сообщить();
	Исключение
		НовыйДокумент.Удалить();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не удалось установить подключение. Регистрация не выполнена';uk='Не вдалося встановити підключення. Реєстрація не виконана'");
		Сообщение.Сообщить(); 
	КонецПопытки;

КонецПроцедуры 


&НаСервереБезКонтекста
Функция ПолучитьЦУ()

	Возврат ПланыОбмена.ОСМД.НайтиПоКоду("001");

КонецФункции // ()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Предмет") Тогда
		Предмет = Параметры.Предмет;
	КонецЕсли;
	
	//
	//ЦентральныйУзел = ПланыОбмена.ОСМД.НайтиПоКоду("001");
	//Если ЦентральныйУзел.Пустая() Тогда
	//	Элементы.Отправка.Видимость = Ложь;
	//	Элементы.Регистрация.Видимость = Истина;
	//Иначе
	//	Элементы.Отправка.Видимость = Истина;
	//	Элементы.Регистрация.Видимость = Ложь;
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Декорация15Нажатие(Элемент)
	ЗапуститьПриложение("http://www.hvoya.com.ua");
КонецПроцедуры

&НаКлиенте
Процедура Декорация20Нажатие(Элемент)
	ЗапуститьПриложение("https://portal.1c.eu");
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуСостоянияБД()

	Возврат УчетКоммунальныхУслуг.ПолучитьСтрокуСостоянияБД();
	
КонецФункции // ПолучитьСтрокуСостоянияБД()

&НаСервере
Функция ПолучитьИдентификаторБД()

	Возврат УчетКоммунальныхУслуг.ПолучитьИдентификаторБД();

КонецФункции // ПолучитьИдентификаторБД()


&НаКлиенте
Процедура Декорация30Нажатие(Элемент)
	ЗапуститьAnyDesk();
КонецПроцедуры

&НаКлиенте
Процедура Декорация31Нажатие(Элемент)
	ЗапуститьAnyDesk();
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьAnyDesk()

#Если ВебКлиент Тогда
	Текст = "ru = ""Система не поддерживает работу в Web-клиенте""; uk = ""Система не підтримує роботу в Web-клієнті""";
	Предупреждение(НСтр(Текст), 10);
#Иначе
	
	МассивФайлов = НайтиФайлы("C:\Program Files\AnyDesk\AnyDesk.exe");
	Если МассивФайлов.Количество() > 0  тогда
		ЗапуститьПриложение("C:\Program Files\AnyDesk\AnyDesk.exe");
	Иначе 
		
		МассивФайлов = НайтиФайлы("C:\","AnyDesk.exe", Истина);
		Если МассивФайлов.Количество() > 0  тогда
			ЗапуститьПриложение(МассивФайлов[0].ПолноеИмя);
		Иначе 
			
			Текст = НСтр("ru='Программа AnyDesk не установлена. Зайти на сайт AnyDesk?';uk=' Програма AnyDesk не встановлена. Зайти на сайт AnyDesk?'");
			
			Результат = Вопрос(Текст, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
			Если Результат = КодВозвратаДиалога.Да Тогда
				ЗапуститьПриложение("https://anydesk.com/ru/");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
#КонецЕсли

КонецПроцедуры 

&НаКлиенте
Процедура Декорация13Нажатие(Элемент)
	ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.ФормаОбъекта",Новый Структура("Ключ", РаботаСПочтовымиСообщениями.ПолучитьСистемнуюУчетнуюЗапись()));
КонецПроцедуры

&НаКлиенте
Процедура Декорация32Нажатие(Элемент)
	ЗапуститьПриложение("http://osmd.hvoya.com.ua/");
КонецПроцедуры
